import styled from "styled-components";

export const TermWrapper = styled.p`
  white-space: pre-wrap;
`;

function Term() {
  return (
    <TermWrapper>
      {`
이용약관

제1조(목적)
CAKE(케이크) 서비스 이용약관은 회사가 서비스를 제공함에 있어, 회사와 이용자 간의 권리, 의무 및 책임 사항 등을 규정함을 목적으로 합니다.

제2조(약관 등의 명시와 설명 및 개정)
1. 회사는 이 약관을 회원가입 화면 및 ‘내 정보’ 메뉴 등에 게시합니다.
2. 회사는 관련법을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.
3. 개정 내용이 회원에게 불리할 경우, 적용일자 및 개정사유를 명시하여 현행약관과 함께 “공지사항”에 30일 간 게시합니다.
4. 회원이 개정약관의 적용에 동의하지 않는 경우, 이용계약을 해지함으로써 거부 의사를 표시할 수 있습니다. 단, 30일 내에 거부 의사 표시를 하지 않을 경우 약관에 동의한 것으로 간주합니다.
5. 회원은 약관 일부분만을 동의 또는 거부할 수 없습니다.
6. 비회원이 서비스를 이용할 경우, 이 약관에 동의한 것으로 간주합니다.

제3조(서비스의 제공)
1. 회사는 다음 서비스를 제공합니다.
    a. 1:1 스터디
    b. N명 스터디
    c. 기타 회사가 정하는 서비스
2. 회사는 운영상, 기술상의 필요에 따라 제공하고 있는 서비스를 변경할 수 있습니다.
3. 회사는 이용자의 개인정보 및 서비스 이용 기록에 따라 서비스 이용에 차이를 둘 수 있습니다.
4. 회사는 천재지변, 인터넷 장애, 경영 악화 등으로 인해 서비스를 더이상 제공하기 어려울 경우, 서비스를 통보없이 중단할 수 있습니다.
5. 회사는 1항부터 전항까지와 다음 내용으로 인해 발생한 피해에 대해 어떠한 책임을 지지 않습니다.
    a. 모든 서비스, 게시물, 이용 기록의 진본성, 무결성, 신뢰성, 이용가능성
    b. 서비스 이용 중 타인과 상호 간에 합의한 내용
    c. 게시물, 광고의 버튼, 하이퍼링크 등 외부로 연결된 서비스와 같이 회사가 제공하지 않은 서비스에서 발생한 피해
    d. 이용자의 귀책사유 또는 회사의 귀책사유가 아닌 사유로 발생한 이용자의 피해

제4조(서비스 이용계약의 성립)
1. CAKE(케이크)는 학생증, 증명서 등을 통해 해당 대학교의 학부 재학생 및 졸업생 또는 해당년도 입학생으로 인증받은 이용자에 한해 이용할 수 있는 어플입니다. 해당 대학교의 학생이 아닌 이용자와 만 14세 미만의 이용자는 서비스를 이용하거나 회원가입을 할 수 없으며, 그럼에도 불구하고 성립된 회원가입은 무효로 간주합니다.
2. 회사와 회원의 서비스 이용계약은 서비스 내부의 회원가입 화면의 가입 양식에 따라 회원정보를 기입한 후 필수약관에 동의한다는 의사표시를 한 비회원의 이용신청에 대하여, 서비스 화면에 이용승낙을 표시하는 방법 등으로 의사표시를 하면서 체결됩니다.
3. 승낙은 신청순서에 따라 순차적으로 처리되며, 회원가입의 성립시기는 회사의 승난이 회원에게 도달한 시점으로 합니다.
4. 회사는 부정사용방지 및 본인확인을 위해 회원에게 본인 인증 및 학교 인증을 요청할 수 있습니다.

제5조(개인정보의 관리 및 보호)
1. 회원이 회사와 체결한 서비스 이용계약은 처음 이용계약을 체결한 본인에 한해 적용됩니다.
2. 회원이 회원가입 시 등록한 정보에 변동이 있을 경우, 즉시 “내정보” 메뉴 등을 이용하여 정보를 최신화해야 합니다.
3. 회원의 아이디, 비밀번호, 이메일, 대학생 정보 등 모든 개인정보의 관리책임은 본인에게 있으므로, 타인에게 양도 및 대여할 수 없으며, 유출되지 않도록 관리해야 합니다. 만약 본인의 아이디 및 비밀번호를 타인이 사용하고 있음을 인지했을 경우 바로 서비스 내부의 문의 창구에 알려야 하고, 안내가 있는 경우 이에 즉시 따라야 합니다.
4. 회사는 2항부터 전항까지를 이행하지 않아 발생한 피해에 대해 어떠한 책임도 지지 않습니다.

제6조(서비스 이용계약의 종료)
1. 회원은 언제든지 본인의 계정으로 로그인한 뒤 서비스 내부의 “탈퇴하기” 버튼을 누르는 방법으로 탈퇴를 요청할 수 있으며, 문의 창구를 통한 탈퇴 요청 등은 처리되지 않습니다. 회사는 해당 요청을 확인한 후 탈퇴를 처리합니다.
2. 탈퇴 처리가 완료 되었더라도, 회원이 게시한 게시물은 삭제되지 않습니다.
3. 회사는 회원이 연속하여 1년 동안 로그인을 하지 않을 경우, 회원의 동의 없이 회원자격을 박탈할 수 있습니다.
4. 회사는 천재지변, 테러,폐교 등 불가피한 사유로 더이상 서비스를 제공할 수 없을 경우, 회원의 동의없이 회원자격을 박탈할 수 있습니다.
5. 회사는 1항부터 전항까지로 인해 발생한 피해에 대해 어떠한 책임을 지지 않습니다.

제7조(회원에 대한 통보)
1. 회사가 회원에 대한 통보를 하는 경우, 서비스 내부 알림 수단과 회원의 연락처를 이용합니다.
2. 회사는 다수의 회원에 대한 통보를 할 경우 공지사항 등에 게시함으로써 개별 통보에 갈음할 수 있습니다.
3. 회원이 30일 이내에 의사표시를 하지 않을 경우, 통보 내용에 대해 동의한 것으로 간주합니다.

제8조(광고의 게재 및 발신)
1. 회사는 서비스의 제공을 위해 서비스 내부에 광고를 게재할 수 있습니다.
2. 회사는 이용자의 이용 기록을 활용한 광고를 게재할 수 있습니다.
3. 회사는 회원이 광고성 정보 수신에 동의할 경우, 서비스 내부 알림 수단과 회원의 연락처를 이용하여 광고성 정보를 발신할 수 있습니다.
`}
    </TermWrapper>
  );
}

export default Term;
